zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pssi.c
    if (hpssi->XferCount > PSSI_MAX_NBYTE_SIZE)
    {
      hpssi->XferSize = PSSI_MAX_NBYTE_SIZE;
    }
    else
    {
      hpssi->XferSize = Size;
    }

    if (hpssi->hdmatx != NULL)
    {
      /* Packing mode management is enabled by the DMA settings */
      if (((hpssi->Init.DataWidth == HAL_PSSI_32BITS) && \
           (hpssi->hdmatx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_WORD)) || \
          ((hpssi->Init.DataWidth == HAL_PSSI_16BITS) && \
           (hpssi->hdmatx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_HALFWORD)) || \
          ((hpssi->Init.DataWidth == HAL_PSSI_8BITS)  && \
           (hpssi->hdmatx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_BYTE)))
      {
        /* Restriction the DMA data received is not allowed in this mode */
        __HAL_UNLOCK(hpssi);
        return HAL_ERROR;
      }

      /* Set the PSSI DMA transfer complete callback */
      hpssi->hdmatx->XferCpltCallback = PSSI_DMATransmitCplt;

      /* Set the DMA error callback */
      hpssi->hdmatx->XferErrorCallback = PSSI_DMAError;

      /* Set the unused DMA callbacks to NULL */
      hpssi->hdmatx->XferHalfCpltCallback = NULL;
      hpssi->hdmatx->XferAbortCallback = NULL;

      /* Disable the selected PSSI peripheral */
      HAL_PSSI_DISABLE(hpssi);

      /* Disable DMA  in PSSI CR */
      hpssi->Instance->CR &= PSSI_CR_DMA_DISABLE;

      /* Enable the DMA  */
      if ((hpssi->hdmatx->Mode & DMA_LINKEDLIST) == DMA_LINKEDLIST)
      {
        if (hpssi->hdmatx->LinkedListQueue != NULL)
        {
          /* Enable the DMA channel */
          /* Set DMA data size */
          hpssi->hdmatx->LinkedListQueue->Head->LinkRegisters[NODE_CBR1_DEFAULT_OFFSET] = hpssi->XferSize;
          /* Set DMA source address */
          hpssi->hdmatx->LinkedListQueue->Head->LinkRegisters[NODE_CSAR_DEFAULT_OFFSET] = (uint32_t)hpssi->pBuffPtr;
          /* Set DMA destination address */
          hpssi->hdmatx->LinkedListQueue->Head->LinkRegisters[NODE_CDAR_DEFAULT_OFFSET] =
            (uint32_t)&hpssi->Instance->DR;

          dmaxferstatus = HAL_DMAEx_List_Start_IT(hpssi->hdmatx);
        }
        else
        {
          /* Unlock the process */
          __HAL_UNLOCK(hpssi);

          hpssi->State = HAL_PSSI_STATE_READY;
          /* Return error status */
          return HAL_ERROR;
        }
      }
      else
      {
        dmaxferstatus = HAL_DMA_Start_IT(hpssi->hdmatx, (uint32_t)pData, (uint32_t)&hpssi->Instance->DR,
                                         hpssi->XferSize);
      }
      /* Check status */
      if (dmaxferstatus != HAL_OK)
      {
        /* Update PSSI error code */
        hpssi->ErrorCode |= HAL_PSSI_ERROR_DMA;

        /* Process Unlocked */
        __HAL_UNLOCK(hpssi);

        /* Update PSSI state */
        hpssi->State = HAL_PSSI_STATE_READY;
        return HAL_ERROR;
      }

      /* Configure BusWidth */
      MODIFY_REG(hpssi->Instance->CR, PSSI_CR_OUTEN | PSSI_CR_CKPOL,
                 PSSI_CR_OUTEN_OUTPUT | ((hpssi->Init.ClockPolarity == HAL_PSSI_RISING_EDGE) ? 0U : PSSI_CR_CKPOL));
      /* Process Unlocked */
      __HAL_UNLOCK(hpssi);

      /* Note : The PSSI interrupts must be enabled after unlocking current process
                to avoid the risk of PSSI interrupt handle execution before current
                process unlock */
      /* Enable ERR interrupt */
      HAL_PSSI_ENABLE_IT(hpssi, PSSI_FLAG_OVR_RIS);

      /* Enable DMA Request */
      hpssi->Instance->CR |= PSSI_CR_DMA_ENABLE;
      /* Enable the selected PSSI peripheral */
      HAL_PSSI_ENABLE(hpssi);
    }

    else
    {
      /* Update PSSI state */
      hpssi->State = HAL_PSSI_STATE_READY;

      /* Update PSSI error code */
      hpssi->ErrorCode |= HAL_PSSI_ERROR_DMA;

      /* Process Unlocked */
      __HAL_UNLOCK(hpssi);

      return HAL_ERROR;
    }

    return HAL_OK;
  }

  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  Receive an amount of data in non-blocking mode with DMA
  * @param  hpssi Pointer to a PSSI_HandleTypeDef structure that contains
  *                the configuration information for the specified PSSI.
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be received (in bytes)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PSSI_Receive_DMA(PSSI_HandleTypeDef *hpssi, uint8_t *pData, uint32_t Size)
{
  HAL_StatusTypeDef dmaxferstatus;
  if (((hpssi->Init.DataWidth == HAL_PSSI_8BITS) && (hpssi->Init.BusWidth != HAL_PSSI_8LINES)) ||
      ((hpssi->Init.DataWidth == HAL_PSSI_8BITS) && ((Size % 8U) != 0U))   ||
      ((hpssi->Init.DataWidth == HAL_PSSI_16BITS) && ((Size % 16U) != 0U)) ||
      ((hpssi->Init.DataWidth == HAL_PSSI_32BITS) && ((Size % 32U) != 0U)))
  {
    hpssi->ErrorCode = HAL_PSSI_ERROR_NOT_SUPPORTED;
    return HAL_ERROR;
  }

  if ((pData == NULL) || (Size == 0UL))
  {
    __HAL_UNLOCK(hpssi);
    return HAL_ERROR;
  }

  if (hpssi->State == HAL_PSSI_STATE_READY)
  {
    /* Process Locked */
    __HAL_LOCK(hpssi);

    /* Prepare transfer parameters */
    hpssi->State       = HAL_PSSI_STATE_BUSY_RX;
    hpssi->ErrorCode   = HAL_PSSI_ERROR_NONE;
    hpssi->pBuffPtr    = pData;
    hpssi->XferCount   = Size;

    if (hpssi->XferCount > PSSI_MAX_NBYTE_SIZE)
    {
      hpssi->XferSize = PSSI_MAX_NBYTE_SIZE;
    }
    else
    {
      hpssi->XferSize = Size;
    }

    if (hpssi->hdmarx != NULL)
    {
      /* Packing mode management is enabled by the DMA settings */
      if (((hpssi->Init.DataWidth == HAL_PSSI_32BITS) && \
           (hpssi->hdmarx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_WORD)) || \
          ((hpssi->Init.DataWidth == HAL_PSSI_16BITS) && \
           (hpssi->hdmarx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_HALFWORD)) || \
          ((hpssi->Init.DataWidth == HAL_PSSI_8BITS)  && \
           (hpssi->hdmarx->Init.SrcDataWidth !=  DMA_SRC_DATAWIDTH_BYTE)))
      {
        /* Restriction the DMA data received is not allowed in this mode */
        __HAL_UNLOCK(hpssi);
        return HAL_ERROR;
      }

      /* Set the PSSI DMA transfer complete callback */
      hpssi->hdmarx->XferCpltCallback = PSSI_DMAReceiveCplt;

      /* Set the DMA error callback */
      hpssi->hdmarx->XferErrorCallback = PSSI_DMAError;

      /* Set the unused DMA callbacks to NULL */
      hpssi->hdmarx->XferHalfCpltCallback = NULL;
      hpssi->hdmarx->XferAbortCallback = NULL;

      /* Disable the selected PSSI peripheral */
      HAL_PSSI_DISABLE(hpssi);

      /* Disable DMA  in PSSI CR */
      hpssi->Instance->CR &= PSSI_CR_DMA_DISABLE;

